HalloYang06/PSOC_E84_robot/libraries/components/wifi-host-driver/porting/src/wlan/whd_wlan.c
    rt_memset(&wlan_info, 0, sizeof(wlan_info));

    rt_memcpy(&wlan_info.bssid[0], bss_info->BSSID.octet, sizeof(wlan_info.bssid));
    rt_memcpy(wlan_info.ssid.val, bss_info->SSID.value, bss_info->SSID.length);
    wlan_info.ssid.len = bss_info->SSID.length;
    if (bss_info->SSID.length)
        wlan_info.hidden = 0;
    else
        wlan_info.hidden = 1;

    wlan_info.channel = (rt_int16_t)bss_info->channel;
    wlan_info.rssi = bss_info->signal_strength;

    wlan_info.datarate = bss_info->max_data_rate * 1000;

    switch (bss_info->band)
    {
        case WHD_802_11_BAND_5GHZ:      wlan_info.band = RT_802_11_BAND_5GHZ; break;
        case WHD_802_11_BAND_2_4GHZ:    wlan_info.band = RT_802_11_BAND_2_4GHZ; break;
        case WHD_802_11_BAND_6GHZ:      wlan_info.band = RT_802_11_BAND_UNKNOWN; break;
    }

    wlan_info.security = (rt_wlan_security_t)bss_info->security;

    bss_info ++;

    buff.data = &wlan_info;
    buff.len = sizeof(wlan_info);

    rt_wlan_dev_indicate_event_handle(wlan, RT_WLAN_DEV_EVT_SCAN_REPORT, &buff);

    memset(*result_ptr, 0, sizeof(whd_scan_result_t));
}

static rt_err_t drv_wlan_scan(struct rt_wlan_device *wlan, struct rt_scan_info *scan_info)
{
    struct whd_scan *whd_scan = rt_malloc(sizeof(struct whd_scan));

    /* Let the module scan with the active type first, and then scan the nearby ap with the passive type */

    RT_ASSERT(whd_scan != NULL);
    whd_scan->wlan = wlan;
    whd_scan->whd_scan_type = WHD_SCAN_TYPE_ACTIVE;
    whd_scan->active_sem = rt_sem_create("whd scan", 0, RT_IPC_FLAG_PRIO);
    RT_ASSERT(whd_scan->active_sem != NULL);

    /* Execute an active type scan */
    if (whd_wifi_scan(get_drv_wifi(wlan)->whd_itf, whd_scan->whd_scan_type, WHD_BSS_TYPE_ANY,
                            NULL, NULL, NULL, NULL, whd_scan_callback, &whd_scan->scan_result, whd_scan) != WHD_SUCCESS)
    {
        return RT_EOK;
    }

    /* Wait until the active scan is complete */
    rt_sem_take(whd_scan->active_sem, rt_tick_from_millisecond(10000));

    /* Execute an active type scan */
    return whd_wifi_scan(get_drv_wifi(wlan)->whd_itf, whd_scan->whd_scan_type, WHD_BSS_TYPE_ANY,
                            NULL, NULL, NULL, NULL, whd_scan_callback, &whd_scan->scan_result, whd_scan);
}

static rt_err_t drv_wlan_join(struct rt_wlan_device *wlan, struct rt_sta_info *sta_info)
{
    rt_err_t ret;
    whd_ssid_t whd_ssid = { .length = sta_info->ssid.len };

    memcpy(whd_ssid.value, sta_info->ssid.val, whd_ssid.length);

    ret = whd_wifi_join(get_drv_wifi(wlan)->whd_itf, &whd_ssid, WHD_SECURITY_WPA2_AES_PSK,
                            (const uint8_t *)sta_info->key.val, sta_info->key.len);

    if (ret != WHD_SUCCESS)
    {
        rt_wlan_dev_indicate_event_handle(wlan, RT_WLAN_DEV_EVT_CONNECT_FAIL, RT_NULL);
    }

    return ret;
}

static rt_err_t drv_wlan_softap(struct rt_wlan_device *wlan, struct rt_ap_info *ap_info)
{
    rt_err_t ret;

    ret = whd_wifi_init_ap(get_drv_wifi(wlan)->whd_itf,
                            (whd_ssid_t*)&ap_info->ssid,
                            (whd_security_t)ap_info->security,
                            (const uint8_t *) ap_info->key.val,
                            ap_info->key.len, ap_info->channel);

    if (ret != WHD_SUCCESS)
    {
        return ret;
    }

    if ((ret = whd_wifi_start_ap(get_drv_wifi(wlan)->whd_itf)) == WHD_SUCCESS)
    {
        rt_wlan_dev_indicate_event_handle(wifi_ap.wlan, RT_WLAN_DEV_EVT_AP_START, 0);
    }
    else
    {
        rt_wlan_dev_indicate_event_handle(wifi_ap.wlan, RT_WLAN_DEV_EVT_AP_STOP, 0);
    }

    return ret;
}

static rt_err_t drv_wlan_disconnect(struct rt_wlan_device *wlan)
{
    rt_err_t ret = whd_wifi_leave(get_drv_wifi(wlan)->whd_itf);

    if (ret == WHD_SUCCESS)
    {
        rt_wlan_dev_indicate_event_handle(wlan, RT_WLAN_DEV_EVT_DISCONNECT, RT_NULL);
    }
    return ret;
}

static rt_err_t drv_wlan_ap_stop(struct rt_wlan_device *wlan)
{
    if (whd_wifi_stop_ap(get_drv_wifi(wlan)->whd_itf) == WHD_SUCCESS)
    {
        rt_wlan_dev_indicate_event_handle(wifi_ap.wlan, RT_WLAN_DEV_EVT_AP_STOP, 0);
    }
    return RT_EOK;
}

static rt_err_t drv_wlan_ap_deauth(struct rt_wlan_device *wlan, rt_uint8_t mac[])
{
    whd_mac_t _mac;

    memcpy(&_mac, mac, sizeof(whd_mac_t));
    return whd_wifi_deauth_sta(get_drv_wifi(wlan)->whd_itf, &_mac, WHD_DOT11_RC_RESERVED);
}

static rt_err_t drv_wlan_scan_stop(struct rt_wlan_device *wlan)
{
    whd_wifi_stop_scan(get_drv_wifi(wlan)->whd_itf);
    return RT_EOK;
}

static int drv_wlan_get_rssi(struct rt_wlan_device *wlan)
{
    int32_t rssi;

    whd_wifi_get_rssi(get_drv_wifi(wlan)->whd_itf, &rssi);

    return rssi;
}

static rt_err_t drv_wlan_set_powersave(struct rt_wlan_device *wlan, int level)
{
    if (level)
    {
        return whd_wifi_enable_powersave(get_drv_wifi(wlan)->whd_itf);
    }
    else
    {
        return whd_wifi_disable_powersave(get_drv_wifi(wlan)->whd_itf);
    }
}

static int drv_wlan_get_powersave(struct rt_wlan_device *wlan)
{
    uint32_t value = 0;

    whd_wifi_get_powersave_mode(get_drv_wifi(wlan)->whd_itf, &value);

    return value;
}

static rt_err_t drv_wlan_set_channel(struct rt_wlan_device *wlan, int channel)
{
    return whd_wifi_set_channel(get_drv_wifi(wlan)->whd_itf, channel);
}

static int drv_wlan_get_channel(struct rt_wlan_device *wlan)
{
    uint32_t channel = 0;

    whd_wifi_get_channel(get_drv_wifi(wlan)->whd_itf, &channel);

    return channel;
}

static rt_country_code_t drv_wlan_get_country(struct rt_wlan_device *wlan)
{
    if (whd_config.country == WHD_COUNTRY_CHINA)
    {
        return RT_COUNTRY_CHINA;
    }
    else
    {
        return RT_COUNTRY_UNKNOWN;
    }
}

static rt_err_t drv_wlan_set_mac(struct rt_wlan_device *wlan, rt_uint8_t mac[])
{
    whd_mac_t whd_mac;

    memcpy(whd_mac.octet, mac, sizeof(whd_mac.octet));

    return whd_wifi_set_mac_address(get_drv_wifi(wlan)->whd_itf, whd_mac);
}

static rt_err_t drv_wlan_get_mac(struct rt_wlan_device *wlan, rt_uint8_t mac[])
{
    rt_err_t ret;
    whd_mac_t whd_mac;

    if (wlan == wifi_ap.wlan)
    {
        if ((ret = whd_wifi_get_mac_address(wifi_sta.whd_itf, &whd_mac)) == WHD_SUCCESS)
        {
            /* AP interface needs to come up with MAC different from STA  */
            if (whd_mac.octet[0] & 0x02)
            {
                whd_mac.octet[0] &= (uint8_t) ~(0x02);
            }
            else
            {
                whd_mac.octet[0] |= 0x02;
            }
        }
    }
    else
    {
        ret = whd_wifi_get_mac_address(get_drv_wifi(wlan)->whd_itf, &whd_mac);
    }

    if (ret == WHD_SUCCESS)
    {
        memcpy(mac, whd_mac.octet, RT_WLAN_BSSID_MAX_LENGTH);
    }

    return ret;
}

static int drv_wlan_recv(struct rt_wlan_device *wlan, void *buff, int len)
{
    return RT_EOK;
}

static int drv_wlan_send(struct rt_wlan_device *wlan, void *buff, int len)
{
    whd_buffer_t buffer;

    /* Determines if a particular interface is ready to transceive ethernet packets */
    if (whd_wifi_is_ready_to_transceive(get_drv_wifi(wlan)->whd_itf) != WHD_SUCCESS)
    {
        return -RT_ERROR;
    }

    /* Creating a transport layer pbuf allows WHD to add link data to the pbuf header */
    if (whd_host_buffer_get(get_drv_wifi(wlan)->whd_itf->whd_driver, &buffer, WHD_NETWORK_TX, len + WHD_LINK_HEADER, 1000) != 0)
    {
        LOG_D("err whd_host_buffer_get failed\n");
        return -RT_ERROR;
    }

    /* Sets the offset of buffer data position
     * It is reserved for whd to write link header data
     */
    whd_buffer_add_remove_at_front(get_drv_wifi(wlan)->whd_itf->whd_driver, &buffer, WHD_LINK_HEADER);

    /* Copy network data to WHD */
    memcpy(whd_buffer_get_current_piece_data_pointer(get_drv_wifi(wlan)->whd_itf->whd_driver, buffer), buff, len);

