HalloYang06/PSOC_E84_robot/libraries/components/wifi-host-driver/porting/src/wlan/whd_wlan.c
    /*
     *  This function takes ethernet data from the network stack and queues it for transmission over the wireless network.
     *  The function can be called from any thread context as it is thread safe, however
     *  it must not be called from interrupt context since it might get blocked while waiting
     *  for a lock on the transmit queue.
     */
    whd_network_send_ethernet_data(get_drv_wifi(wlan)->whd_itf, buffer);

    return RT_EOK;
}

static const struct rt_wlan_dev_ops ops =
{
    .wlan_init = drv_wlan_init,
    .wlan_mode = drv_wlan_mode,
    .wlan_scan = drv_wlan_scan,
    .wlan_join = drv_wlan_join,
    .wlan_softap = drv_wlan_softap,
    .wlan_disconnect = drv_wlan_disconnect,
    .wlan_ap_stop = drv_wlan_ap_stop,
    .wlan_ap_deauth = drv_wlan_ap_deauth,
    .wlan_scan_stop = drv_wlan_scan_stop,
    .wlan_get_rssi = drv_wlan_get_rssi,
    .wlan_set_powersave = drv_wlan_set_powersave,
    .wlan_get_powersave = drv_wlan_get_powersave,
    .wlan_cfg_promisc = NULL,
    .wlan_cfg_filter = NULL,
    .wlan_cfg_mgnt_filter = NULL,
    .wlan_set_channel = drv_wlan_set_channel,
    .wlan_get_channel = drv_wlan_get_channel,
    .wlan_set_country = NULL,
    .wlan_get_country = drv_wlan_get_country,
    .wlan_set_mac = drv_wlan_set_mac,
    .wlan_get_mac = drv_wlan_get_mac,
    .wlan_recv = drv_wlan_recv,
    .wlan_send = drv_wlan_send,
};

/*
 * This function takes packets from the radio driver and passes them into the
 * lwIP stack. If the stack is not initialized, or if the lwIP stack does not
 * accept the packet, the packet is freed (dropped). If the packet is of type EAPOL
 * and if the Extensible Authentication Protocol over LAN (EAPOL) handler is registered, the packet will be redirected to the registered
 * handler and should be freed by the EAPOL handler.
 */
void cy_network_process_ethernet_data(whd_interface_t iface, whd_buffer_t buf)
{
    uint16_t ethertype;
    uint8_t *data = whd_buffer_get_current_piece_data_pointer(iface->whd_driver, buf);
    struct rt_wlan_device *wlan = wifi_ap.whd_itf == iface ? wifi_ap.wlan : wifi_sta.wlan;

    #define EAPOL_PACKET_TYPE                        (0x888E)

    if (iface->role == WHD_STA_ROLE)
    {

    }
    else if (iface->role == WHD_AP_ROLE)
    {

    }
    else
    {
        whd_buffer_release(iface->whd_driver, buf, WHD_NETWORK_RX);
        return;
    }

    ethertype = (uint16_t) (data[12] << 8 | data[13]);
    if (ethertype == EAPOL_PACKET_TYPE)
    {
        LOG_D("EAPOL_PACKET_TYPE");
    }
    else
    {
        /* If the interface is not yet set up, drop the packet */
        LOG_D("Send data up to wlan");
        rt_wlan_dev_report_data(wlan, data, whd_buffer_get_current_piece_size(iface->whd_driver, buf));
        whd_buffer_release(iface->whd_driver, buf, WHD_NETWORK_RX);
    }
}

static whd_netif_funcs_t netif_if_ops =
{
    .whd_network_process_ethernet_data = cy_network_process_ethernet_data,
};

/**
 * Event handler prototype definition
 *
 * @param[out] whd_event_header_t : whd event header
 * @param[out] uint8_t*           : event data
 * @param[out] handler_user_data  : semaphore data
 */
void *whd_event_handler(whd_interface_t ifp, const whd_event_header_t *event_header, const uint8_t *event_data, void *user_data)
{
    struct drv_wifi *wifi = (struct drv_wifi *)user_data;

    LOG_D("whd_event_handler, event_type: %u", event_header->event_type);

    switch (event_header->event_type)
    {
        case WLC_E_ASSOC:
        case WLC_E_REASSOC:
            LOG_D("Connected.");
            rt_wlan_dev_indicate_event_handle(wifi->wlan, RT_WLAN_DEV_EVT_CONNECT, RT_NULL);
        break;

        case WLC_E_LINK:
            if (event_header->reason != 0)
            {
                LOG_D("Disconnected, reason: %u", event_header->reason);
                rt_wlan_dev_indicate_event_handle(wifi->wlan, RT_WLAN_DEV_EVT_DISCONNECT, RT_NULL);
            }
        break;
    }

    return user_data;
}

static void register_whd_events (void)
{
    uint16_t event_index = 0;
    uint32_t event_list[] = { WLC_E_ASSOC, WLC_E_REASSOC, WLC_E_LINK, WLC_E_NONE };
    if (whd_wifi_set_event_handler(wifi_sta.whd_itf, event_list, whd_event_handler, &wifi_sta, &event_index) != WHD_SUCCESS)
    {
        LOG_W("Failed to register the whd event");
    }
}

rt_weak void whd_bt_startup (void)
{
    /* The callback indicates that the hci interface is ready.
     * The user rewrites this function to initialize or configure the Bluetooth protocol stack.
     */
}

static void whd_init_thread (void *parameter)
{
    static struct rt_wlan_device wlan_ap, wlan_sta;
    whd_oob_config_t oob_config =
    {
#ifndef CYBSP_USING_PIN_NAME
        .host_oob_pin      = CYBSP_HOST_WAKE_IRQ_PIN,
#else
        .host_oob_pin      = rt_pin_get(CYBSP_HOST_WAKE_IRQ_PIN_NAME),
#endif
        .dev_gpio_sel      = 0,
#ifdef CYBSP_HOST_WAKE_IRQ_EVENT_FALL
        .is_falling_edge   = WHD_TRUE,
#else
        .is_falling_edge   = WHD_FALSE,
#endif
        .intr_priority     = CYBSP_OOB_INTR_PRIORITY
    };
    whd_sdio_config_t whd_sdio_config =
    {
        .sdio_1bit_mode        = WHD_FALSE,
        .high_speed_sdio_clock = WHD_FALSE,
        .oob_config            = oob_config
    };

    wifi_ap.wlan = &wlan_ap;
    wifi_sta.wlan = &wlan_sta;
    whd_diag_mark(WHD_DIAG_STAGE_BOOT, 0);


    /* Creates a semaphore to wait probe the sdio card */
    cyhal_sdio.probe = rt_sem_create("sdio probe", 0, RT_IPC_FLAG_PRIO);
    RT_ASSERT(cyhal_sdio.probe != NULL);
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_PROBE_SEM_CREATED, 0);

    /* Register the sdio driver */
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_INIT_START, 0);
    if (cyhal_sdio_init(&cyhal_sdio) != CYHAL_SDIO_RET_NO_ERRORS)
    {
        whd_diag_mark(WHD_DIAG_STAGE_SDIO_INIT_START, -1);
        LOG_E("Unable to register SDIO driver to mmcsd!");
        return;
    }
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_INIT_DONE, 0);

    LOG_D("Wait for sdio card registration..");

    /* Waiting card registration and delete the semaphore */
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_PROBE_WAIT, 0);
    if (rt_sem_take(cyhal_sdio.probe, rt_tick_from_millisecond(15000)) != RT_EOK)
    {
        whd_diag_mark(WHD_DIAG_STAGE_SDIO_PROBE_WAIT, -8);
        LOG_E("Timed out waiting for sdio card registration!");
        rt_sem_delete(cyhal_sdio.probe);
        cyhal_sdio.probe = RT_NULL;
        return;
    }
    rt_sem_delete(cyhal_sdio.probe);
    cyhal_sdio.probe = RT_NULL;
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_PROBE_DONE, 0);

    /* Configure sdio high speed mode and bus width */
    if (cyhal_sdio.card->host->freq_max > 25000000)
    {
        whd_sdio_config.high_speed_sdio_clock = WHD_TRUE;
        g_whd_diag_flags |= WHD_DIAG_FLAG_HIGH_SPEED;
        LOG_D("SDIO high speed mode enabled.");
    }

    if (!(cyhal_sdio.card->host->flags & MMCSD_BUSWIDTH_4))
    {
        whd_sdio_config.sdio_1bit_mode = WHD_TRUE;
        g_whd_diag_flags |= WHD_DIAG_FLAG_1BIT_SDIO;
        LOG_D("SDIO 1 bit mode enabled.");
    }

    /* Initialize WiFi Host Drivers (WHD) */
#ifdef WPRINT_ENABLE_WHD_INFO
    WPRINT_MACRO( ("RT-Thread WiFi Host Drivers (WHD)\n") );
    WPRINT_MACRO( ("You can get the latest version on https://github.com/evlers/rt-thread_wifi-host-driver\n") );
#endif /* WPRINT_ENABLE_WHD_INFO */

    /* Initialize WiFi host drivers */
    whd_diag_mark(WHD_DIAG_STAGE_WHD_INIT, 0);
    whd_init(&whd_driver, &whd_config, &resource_ops, &whd_buffer_ops, &netif_if_ops);

    /* Attach a bus SDIO */
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_ATTACH_START, 0);
    if (whd_bus_sdio_attach(whd_driver, &whd_sdio_config, &cyhal_sdio) != WHD_SUCCESS)
    {
        whd_diag_mark(WHD_DIAG_STAGE_SDIO_ATTACH_START, -1);
        LOG_E("Unable to Attach to the sdio bus!");
        return;
    }
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_ATTACH_DONE, 0);

#ifdef WHD_RESOURCES_IN_EXTERNAL_STORAGE_FS
    LOG_D("Wait mounting the external storage of file system..");
    extern void whd_wait_fs_mount (void);
    whd_wait_fs_mount();
#endif
    whd_diag_mark(WHD_DIAG_STAGE_WAIT_FS_DONE, 0);

    /* Switch on Wifi, download firmware and create a primary interface, returns whd_interface_t */
    whd_diag_mark(WHD_DIAG_STAGE_WIFI_ON_START, 0);
    if (whd_wifi_on(whd_driver, &wifi_sta.whd_itf) != WHD_SUCCESS)
    {
        whd_diag_mark(WHD_DIAG_STAGE_WIFI_ON_START, -1);
        LOG_E("Unable to start the WiFi module!");
        return;
    }
    g_whd_diag_flags |= WHD_DIAG_FLAG_STA_IF;
    whd_diag_mark(WHD_DIAG_STAGE_WIFI_ON_DONE, 0);

    /* Bluetooth startup */
    whd_bt_startup();

#ifdef CY_WIFI_DEFAULT_ENABLE_POWERSAVE_MODE
    uint32_t value = 0;
    if (whd_wifi_get_powersave_mode(wifi_sta.whd_itf, &value) != WHD_SUCCESS)
    {
        LOG_E("The powersave mode switch status cannot be get!");
        return;
    }
#endif

    /* Disables 802.11 power save mode on specified interface */
    if (whd_wifi_disable_powersave(wifi_sta.whd_itf) != WHD_SUCCESS)
    {
        whd_diag_mark(WHD_DIAG_STAGE_WIFI_ON_DONE, -2);
        LOG_E("Failed to disable the powersave mode!");
        return;
    }
    whd_diag_mark(WHD_DIAG_STAGE_DISABLE_PS_DONE, 0);

#ifdef CY_WIFI_DEFAULT_ENABLE_POWERSAVE_MODE
    if (value == PM1_POWERSAVE_MODE)
    {
        /* Enables powersave mode on specified interface */
        if (whd_wifi_enable_powersave(wifi_sta.whd_itf) != WHD_SUCCESS)
        {
            LOG_E("Failed to enable the powersave mode!");
            return;
        }

        LOG_D("Enables powersave mode.");
    }
    else if (value == PM2_POWERSAVE_MODE)
    {
        /* Enables powersave mode on specified interface while attempting to maximise throughput */
        /* Note: When working in this mode, sdio communication timeout will occur, which is the normal operation of whd */
        if (whd_wifi_enable_powersave_with_throughput(wifi_sta.whd_itf, CY_WIFI_DEFAULT_PM2_SLEEP_RET_TIME) != WHD_SUCCESS)
        {
            LOG_E("Failed to enable the powersave mode!");
            return;
        }

        LOG_D("Enables powersave mode while attempting to maximise throughput.");
    }
#endif

