HalloYang06/PSOC_E84_robot/libraries/components/wifi-host-driver/porting/src/wlan/whd_wlan.c
    /* Creates a secondary interface, returns whd_interface_t */
    if (whd_add_secondary_interface(whd_driver, NULL, &wifi_ap.whd_itf) != WHD_SUCCESS)
    {
        whd_diag_mark(WHD_DIAG_STAGE_DISABLE_PS_DONE, -3);
        LOG_E("Failed to create a secondary interface!");
        return;
    }
    g_whd_diag_flags |= WHD_DIAG_FLAG_AP_IF;
    whd_diag_mark(WHD_DIAG_STAGE_ADD_AP_IF_DONE, 0);

    /* Registers a handler to receive whd event callbacks. */
    register_whd_events();
    whd_diag_mark(WHD_DIAG_STAGE_EVENTS_REGISTERED, 0);

    /* Register the wlan device and set its working mode */

    /* register wlan device for ap */
    if (rt_wlan_dev_register(&wlan_ap, RT_WLAN_DEVICE_AP_NAME, &ops, 0, &wifi_ap) != RT_EOK)
    {
        whd_diag_mark(WHD_DIAG_STAGE_EVENTS_REGISTERED, -4);
        LOG_E("Failed to register a wlan_ap device!");
        return;
    }
    g_whd_diag_flags |= WHD_DIAG_FLAG_AP_REGISTERED;
    whd_diag_mark(WHD_DIAG_STAGE_REGISTER_AP_DONE, 0);

    /* register wlan device for sta */
    if (rt_wlan_dev_register(&wlan_sta, RT_WLAN_DEVICE_STA_NAME, &ops, 0, &wifi_sta) != RT_EOK)
    {
        whd_diag_mark(WHD_DIAG_STAGE_REGISTER_AP_DONE, -5);
        LOG_E("Failed to register a wlan_sta device!");
        return;
    }
    g_whd_diag_flags |= WHD_DIAG_FLAG_STA_REGISTERED;
    whd_diag_mark(WHD_DIAG_STAGE_REGISTER_STA_DONE, 0);

    /* Set wlan_sta to STATION mode */
    if (rt_wlan_set_mode(RT_WLAN_DEVICE_STA_NAME, RT_WLAN_STATION) != RT_EOK)
    {
        whd_diag_mark(WHD_DIAG_STAGE_REGISTER_STA_DONE, -6);
        LOG_E("Failed to set %s to station mode!", RT_WLAN_DEVICE_STA_NAME);
        return;
    }
    whd_diag_mark(WHD_DIAG_STAGE_SET_STA_MODE_DONE, 0);

    /* Set wlan_ap to AP mode */
    if (rt_wlan_set_mode(RT_WLAN_DEVICE_AP_NAME, RT_WLAN_AP) != RT_EOK)
    {
        whd_diag_mark(WHD_DIAG_STAGE_SET_STA_MODE_DONE, -7);
        LOG_E("Failed to set %s to ap mode!", RT_WLAN_DEVICE_AP_NAME);
        return;
    }
    whd_diag_mark(WHD_DIAG_STAGE_READY, 0);
}

static int rt_hw_wifi_init (void)
{
#ifdef CY_WIFI_USING_THREAD_INIT
    rt_thread_startup(rt_thread_create("whd_init", whd_init_thread, NULL, CY_WIFI_INIT_THREAD_STACK_SIZE, 20, 10));
#else
    whd_init_thread(NULL);
#endif
    return RT_EOK;
}
INIT_ENV_EXPORT(rt_hw_wifi_init);
